classdef Labels
    %CONDITIONS　実験条件を羅列した静的クラス MATLABがだめだめでstatic readonlyできないので書き換えに注意
    %判別させたい実験条件を記す
    
    properties (Constant) 
        c22_normal = ["L6G1"  "L6G5" "L6G10" "L6G15" "L6G20" "L6G25" "L6G30" "L6G35" "L6G40" "L6G45" "L6G50" "L3G1"  "L3G5" "L3G10" "L3G15" "L3G20" "L3G25" "L3G30" "L3G35" "L3G40" "L3G45" "L3G50"];
        c12_normal = ["L1.5G1" "L1.5G25" "L1.5G50" "L3G1" "L3G25" "L3G50" "L4.5G1" "L4.5G25" "L4.5G50" "L6G1" "L6G25" "L6G50"];
        c12_onlyLiquid = ["L1.5" "L1.5" "L1.5" "L3" "L3" "L3" "L4.5" "L4.5" "L4.5" "L6" "L6" "L6"] %液相だけの判別での精度を見るため.
        c9_normal = ["L1.5G1" "L1.5G25" "L1.5G50" "L3G1" "L3G25" "L3G50" "L4.5G1" "L4.5G25" "L4.5G50"];
        c11_normal = ["L1.5G1" "L1.5G25" "L1.5G50" "L3G1" "L3G25" "L3G50" "L4.5G1" "L4.5G25" "L4.5G50" "L6G1" "L6G25" ];
        c6_normal = [ "L3G1" "L3G25" "L3G50"  "L6G1" "L6G25" "L6G50"];
        test = ["L3G1" "L3G25" "L3G50"];
        c12_1209=["1209" "1209" "1209" "1209" "1209" "1209" "1209" "1209" "1209" "1209" "1209" "1209"]
        c12_1209_2=["1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2" "1209-2"]
        c12_1217=["1217" "1217" "1217" "1217" "1217" "1217" "1217" "1217" "1217" "1217" "1217" "1217"]
        c28_normal = ["L0.5G1" "L0.5G3" "L0.5G20" "L0.5G70" "L0.7G1" "L0.7G3" "L0.7G20" "L0.7G70" "L1G1" "L1G3" "L1G20" "L1G70" "L3G1" "L3G3" "L3G20" "L3G70" "L6G1" "L6G3" "L6G20" "L6G70" "L10G1" "L10G3" "L10G20" "L10G70" "L14G1" "L14G3" "L14G20" "L14G70"];
        c28a_normal = ["L0.5G1" "L0.5G3" "L0.5G20" "L0.5G70" "L0.7G1" "L0.7G3" "L0.7G20" "L0.7G70" "L1G1" "L1G3" "L1G20" "L1G70" "L3G1" "L3G3" "L3G20" "L3G70" "L6G1" "L6G3" "L6G20" "L6G70" "L10G1" "L10G3" "L10G20" "L10G70" "L14G1" "L14G3" "L14G20" "L14G50"];
        c30_normal = ["L0.05G1" "L0.05G53" "L0.5G1" "L0.5G3" "L0.5G20" "L0.5G70" "L0.7G1" "L0.7G3" "L0.7G20" "L0.7G70" "L1G1" "L1G3" "L1G20" "L1G70" "L3G1" "L3G3" "L3G20" "L3G70" "L6G1" "L6G3" "L6G20" "L6G70" "L10G1" "L10G3" "L10G20" "L10G70" "L14G1" "L14G3" "L14G20" "L14G50"];
        plugSlug_28 = ["L3G1" "L3G3" "L3G20" "L6G1" "L6G3" "L6G20" ];
        c12a_normal = ["L0.05G1" "L0.05G3" "L0.05G10" "L1G3" "L1G90" "L2G20" "L3G3" "L3G20" "L3G90" "L5G20" "L5G90" "L6G1"];
          
        % 新規追加: 流動様式用ラベル
        flowRegimes = categorical([1, 2, 3, 4, 5]);
        % 1: Stratified
        % 2: Bubbly
        % 3: Slug
        % 4: Plug
        % 5: Annular
    end
end

